zhanzr/cy8ckit-demo/app/mtb_shared/abstraction-rtos/release-v1.13.0/source/COMPONENT_FREERTOS/cyabs_rtos_freertos.c
/***********************************************************************************************//**
 * \file cyabs_rtos_freertos.c
 *
 * \brief
 * Implementation for FreeRTOS abstraction
 *
 ***************************************************************************************************
 * \copyright
 * (c) 2019-2025, Infineon Technologies AG, or an affiliate of Infineon
 * Technologies AG.  SPDX-License-Identifier: Apache-2.0
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 **************************************************************************************************/

#include <cy_utils.h>
#include <cy_result.h>
#include <cyabs_rtos.h>
#include <FreeRTOS.h>
#include <task.h>
#include "cyabs_rtos_internal.h"

/* FreeRTOS pdTRUE/pdFALSE macros expand to boolean-essential literals but are assigned to/compared
   with BaseType_t (signed 32-bit), which is inherent to the FreeRTOS API design. */
CY_MISRA_FP_BLOCK_START("MISRA C-2012 Rule 10.3", 13,
                        "pdTRUE/pdFALSE are boolean-essential but used as BaseType_t per FreeRTOS API.");
CY_MISRA_FP_BLOCK_START("MISRA C-2012 Rule 10.4", 18,
                        "Comparison of BaseType_t with pdTRUE/pdFALSE (boolean) is required by FreeRTOS API.");

static const uint32_t  TASK_IDENT = 0xABCDEF01U;


#if (configUSE_TIMERS == 1)
typedef struct
{
    cy_timer_callback_t     cb;
    cy_timer_callback_arg_t arg;
} callback_data_t;


// Wrapper function to convert FreeRTOS callback signature to match expectation
// for our cyabs_rtos abstraction API.
static void timer_callback(TimerHandle_t arg)
{
    CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 11.5", 1,
                                 "pvTimerGetTimerID returns void*; conversion to callback_data_t* is required to restore the callback context set during timer creation.");
    const callback_data_t* cb_arg = (const callback_data_t*)pvTimerGetTimerID(arg);
    CY_MISRA_BLOCK_END("MISRA C-2012 Rule 11.5");
    if (NULL != cb_arg->cb)
    {
        cb_arg->cb(cb_arg->arg);
    }
}


#endif /* configUSE_TIMERS */


//==================================================================================================
// Error Converter
//==================================================================================================

//--------------------------------------------------------------------------------------------------
// cy_rtos_last_error
//--------------------------------------------------------------------------------------------------
cy_rtos_error_t cy_rtos_last_error(void)
{
    return pdFALSE;
}


//==================================================================================================
// Threads
//==================================================================================================

typedef struct
{
    StaticTask_t      task;
    SemaphoreHandle_t sema;
    uint32_t          magic;
    void*             memptr;
} cy_task_wrapper_t;


//--------------------------------------------------------------------------------------------------
// cy_rtos_thread_create
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_thread_create(cy_thread_t* thread, cy_thread_entry_fn_t entry_function,
                                const char* name, void* stack, uint32_t stack_size,
                                cy_thread_priority_t priority, cy_thread_arg_t arg)
{
    cy_rslt_t status;

    CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 11.6", 1,
                                 "Void-pointer-to-integer ((uint32_t)stack) cast validates stack alignment at system boundary.");
    if ((thread == NULL) || (stack_size < CY_RTOS_MIN_STACK_SIZE))
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else if ((stack != NULL) && (0UL != (((uint32_t)stack) & CY_RTOS_ALIGNMENT_MASK)))
    {
        status = CY_RTOS_ALIGNMENT_ERROR;
    }
    else
    {
        // If the user provides a stack, we need to allocate memory for the StaticTask_t. If we
        // allocate memory we also need to clean it up. This is true when the task exits itself or
        // when it is killed. In the case it is killed is fairly straight forward. In the case
        // where it exits, we can't clean up any allocated memory since we can't free it before
        // calling vTaskDelete() and vTaskDelete() never returns. Thus we need to do it in join.
        // However, if the task exited itself it has also released any memory it allocated. Thus
        // in order to be able to reliably free memory as part of join, we need to know that the
        // data we are accessing (the StaticTask_t) has not been freed. We therefore need to always
        // allocate that object ourselves. This means we also need to allocate the stack if the
        // user did not provide one.
        uint32_t offset = (stack == NULL)
            ? (stack_size & ~CY_RTOS_ALIGNMENT_MASK)
            : 0U;
        uint32_t size  = offset + sizeof(cy_task_wrapper_t);
        CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 11.5", 1,
                                     "pvPortMalloc returns void*; conversion to uint8_t* is required for byte-wise offset computation within one allocated block.");
        uint8_t* ident = (uint8_t*)pvPortMalloc(size);
        CY_MISRA_BLOCK_END("MISRA C-2012 Rule 11.5");

        if (ident == NULL)
        {
            status = CY_RTOS_NO_MEMORY;
        }
        else
        {
            StackType_t stack_size_rtos =
                ((stack_size & ~CY_RTOS_ALIGNMENT_MASK) / sizeof(StackType_t));
            CY_MISRA_FP_BLOCK_START("MISRA C-2012 Rule 11.3", 1,
                                    "Cast from uint8_t* to StackType_t* within single allocated block with guaranteed alignment.");
            CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 11.5", 1,
                                         "Stack storage is represented as void* or uint8_t*; conversion to StackType_t* is required by xTaskCreateStatic API and alignment is validated.");
            StackType_t* stack_rtos = (stack == NULL)
                ? (StackType_t*)ident
                : (StackType_t*)stack;
            CY_MISRA_BLOCK_END("MISRA C-2012 Rule 11.5");
            CY_MISRA_BLOCK_END("MISRA C-2012 Rule 11.3");
            CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 11.3", 1,
                                         "Cast from uint8_t* to cy_task_wrapper_t* within single allocated block. Offset guarantees alignment.");
            CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 18.4", 1,
                                         "Pointer arithmetic computes wrapper address within a single allocated memory block.");
            cy_task_wrapper_t* wrapper = (cy_task_wrapper_t*)(ident + offset);
            CY_MISRA_BLOCK_END("MISRA C-2012 Rule 18.4");
            CY_MISRA_BLOCK_END("MISRA C-2012 Rule 11.3");
            wrapper->sema = xSemaphoreCreateBinary();
            CY_ASSERT(wrapper->sema != NULL);
            wrapper->magic  = TASK_IDENT;
            wrapper->memptr = ident;
            CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 11.4", 1,
                                         "Pointer-to-integer cast required to verify alignment at runtime.");
            CY_ASSERT(((uint32_t)wrapper & CY_RTOS_ALIGNMENT_MASK) == 0UL);
            CY_MISRA_BLOCK_END("MISRA C-2012 Rule 11.4");
            CY_MISRA_FP_BLOCK_START("MISRA C-2012 Rule 11.2", 1,
                                    "xTaskCreateStatic returns TaskHandle_t (incomplete struct pointer) assigned to cy_thread_t.");
            *thread = xTaskCreateStatic((TaskFunction_t)entry_function, name, stack_size_rtos, arg,
                                        (UBaseType_t)priority, stack_rtos, &(wrapper->task));
            CY_MISRA_BLOCK_END("MISRA C-2012 Rule 11.2");
            CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 11.2", 1,
                                         "TaskHandle_t is an opaque FreeRTOS pointer type; debug-only assert compares returned handle identity with wrapper task storage.");
            CY_ASSERT(((void*)*thread == (void*)&(wrapper->task)) || (*thread == NULL));
            CY_MISRA_BLOCK_END("MISRA C-2012 Rule 11.2");
            status = CY_RSLT_SUCCESS;
        }
    }
    CY_MISRA_BLOCK_END("MISRA C-2012 Rule 11.6");

