zhanzr/cy8ckit-demo/app/mtb_shared/abstraction-rtos/release-v1.13.0/source/COMPONENT_FREERTOS/cyabs_rtos_freertos.c
    if (thread == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        *thread = xTaskGetCurrentTaskHandle();
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_thread_wait_notification
//--------------------------------------------------------------------------------------------------
#if (configUSE_TASK_NOTIFICATIONS != 0)
cy_rslt_t cy_rtos_thread_wait_notification(cy_time_t timeout_ms)
{
    uint32_t ret;

    ret = ulTaskNotifyTake(pdTRUE, (timeout_ms == CY_RTOS_NEVER_TIMEOUT) ?
                           portMAX_DELAY : convert_ms_to_ticks(timeout_ms));
    if (0U != ret)
    {
        /* Received notify from another thread or ISR */
        return CY_RSLT_SUCCESS;
    }
    else
    {
        return CY_RTOS_TIMEOUT;
    }
}


#endif /* configUSE_TASK_NOTIFICATIONS */


//--------------------------------------------------------------------------------------------------
// cy_rtos_thread_set_notification
//--------------------------------------------------------------------------------------------------
#if (configUSE_TASK_NOTIFICATIONS != 0)
cy_rslt_t cy_rtos_thread_set_notification(const cy_thread_t* thread)
{
    cy_rslt_t status;
    if (thread == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        if (is_in_isr())
        {
            BaseType_t taskWoken = pdFALSE;
            /* No error checking as this function always returns pdPASS. */
            vTaskNotifyGiveFromISR(*thread, &taskWoken);
            portEND_SWITCHING_ISR(taskWoken);
        }
        else
        {
            /* No error checking as this function always returns pdPASS. */
            CY_MISRA_DEVIATE_BLOCK_START("MISRA_CAST", 1,
                                         "Signedness conversion inside FreeRTOS macro expansion. Cannot modify third-party macro.");
            (void)xTaskNotifyGive(*thread);
            CY_MISRA_BLOCK_END("MISRA_CAST");
        }
        status = CY_RSLT_SUCCESS;
    }
    return status;
}


#endif /* configUSE_TASK_NOTIFICATIONS */


//--------------------------------------------------------------------------------------------------
// cy_rtos_thread_get_name
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_thread_get_name(const cy_thread_t* thread, const char** thread_name)
{
    *thread_name = pcTaskGetName(*thread);
    return CY_RSLT_SUCCESS;
}


//==================================================================================================
// Scheduler
//==================================================================================================
static uint16_t cy_rtos_suspend_count = 0;
static uint16_t cy_rtos_suspend_count_from_ISR = 0;
static UBaseType_t uxSavedInterruptStatus[CY_RTOS_MAX_SUSPEND_NESTING];
//--------------------------------------------------------------------------------------------------
// cy_rtos_scheduler_suspend
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_scheduler_suspend(void)
{
    cy_rslt_t status = CY_RSLT_SUCCESS;
    if (is_in_isr())
    {
        if (cy_rtos_suspend_count_from_ISR < (CY_RTOS_MAX_SUSPEND_NESTING - 1U))
        {
            /* Suspend the Scheduler before interrupts are disabled */
            vTaskSuspendAll();
            uxSavedInterruptStatus[cy_rtos_suspend_count_from_ISR] = taskENTER_CRITICAL_FROM_ISR();
            ++cy_rtos_suspend_count_from_ISR;
        }
        else
        {
            status = CY_RTOS_BAD_PARAM;
        }
    }
    else
    {
        /* Suspend the Scheduler before interrupts are disabled */
        vTaskSuspendAll();
        taskENTER_CRITICAL();
    }

    if (status == CY_RSLT_SUCCESS)
    {
        ++cy_rtos_suspend_count;
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_scheduler_resume
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_scheduler_resume(void)
{
    cy_rslt_t status;
    if (cy_rtos_suspend_count > 0U)
    {
        if (is_in_isr())
        {
            if (cy_rtos_suspend_count_from_ISR > 0U) //We have at least one suspend from ISR call
            {
                taskEXIT_CRITICAL_FROM_ISR(uxSavedInterruptStatus[cy_rtos_suspend_count_from_ISR -
                                                                  1U]);
                --cy_rtos_suspend_count_from_ISR;
                status = CY_RSLT_SUCCESS;
            }
            else
            {
                status = CY_RTOS_BAD_PARAM;
            }
        }
        else
        {
            taskEXIT_CRITICAL();
            status = CY_RSLT_SUCCESS;
        }
        --cy_rtos_suspend_count;
        /* Resume the Scheduler after interrupt are re-enabled */
        (void)xTaskResumeAll();
    }
    else
    {
        status = CY_RTOS_BAD_PARAM;
    }
    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_scheduler_get_state
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_scheduler_get_state(cy_scheduler_state_t* state)
{
    cy_rslt_t status;
    if (state == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        BaseType_t st = xTaskGetSchedulerState();
        switch (st)
        {
            case taskSCHEDULER_NOT_STARTED:
                *state = CY_SCHEDULER_STATE_NOT_STARTED;
                break;

            case taskSCHEDULER_SUSPENDED:
                *state = CY_SCHEDULER_STATE_SUSPENDED;
                break;

            case taskSCHEDULER_RUNNING:
                *state = CY_SCHEDULER_STATE_RUNNING;
                break;

            default:
                *state = CY_SCHEDULER_STATE_UNKNOWN;
                break;
        }

        status = CY_RSLT_SUCCESS;
    }
    return status;
}


//==================================================================================================
// Mutexes
//==================================================================================================

#if (configUSE_MUTEXES == 1)
//--------------------------------------------------------------------------------------------------
// cy_rtos_mutex_init
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_mutex_init(cy_mutex_t* mutex, bool recursive)
{
    cy_rslt_t status;
    if (mutex == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    #if (configUSE_RECURSIVE_MUTEXES != 1)
    else if (recursive)
    {
        /* Recursive mutexes disabled in FreeRTOSConfig */
        status = CY_RTOS_BAD_PARAM;
    }
    #endif /* configUSE_RECURSIVE_MUTEXES */
    else
    {
        mutex->is_recursive = recursive;
        #if (configUSE_RECURSIVE_MUTEXES == 1)
        mutex->mutex_handle = recursive
            ? xSemaphoreCreateRecursiveMutex()
            : xSemaphoreCreateMutex();
        #else
        mutex->mutex_handle = xSemaphoreCreateMutex();
        #endif /* configUSE_RECURSIVE_MUTEXES */
        if (mutex->mutex_handle == NULL)
        {
            status = CY_RTOS_NO_MEMORY;
        }
        else
        {
            status = CY_RSLT_SUCCESS;
        }
    }
    return status;
}


#if defined(FREERTOS_COMMON_SECTION_BEGIN)
FREERTOS_COMMON_SECTION_BEGIN
#endif
//--------------------------------------------------------------------------------------------------
// cy_rtos_mutex_get
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_mutex_get(const cy_mutex_t* mutex, cy_time_t timeout_ms)
{
    cy_rslt_t status;
    if (mutex == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        TickType_t ticks  = convert_ms_to_ticks(timeout_ms);
        BaseType_t result;
        #if (configUSE_RECURSIVE_MUTEXES == 1)
        result = (mutex->is_recursive)
                    ? xSemaphoreTakeRecursive(mutex->mutex_handle, ticks)
                    : xSemaphoreTake(mutex->mutex_handle, ticks);
        #else
        result = xSemaphoreTake(mutex->mutex_handle, ticks);
        #endif /* configUSE_RECURSIVE_MUTEXES */

