zhanzr/cy8ckit-demo/app/mtb_shared/abstraction-rtos/release-v1.13.0/source/COMPONENT_FREERTOS/cyabs_rtos_freertos.c
        status = (result == pdFALSE)
                ? CY_RTOS_TIMEOUT
                : CY_RSLT_SUCCESS;
    }
    return status;
}


#if defined(FREERTOS_COMMON_SECTION_END)
FREERTOS_COMMON_SECTION_END
#endif


#if defined(FREERTOS_COMMON_SECTION_BEGIN)
FREERTOS_COMMON_SECTION_BEGIN
#endif
//--------------------------------------------------------------------------------------------------
// cy_rtos_mutex_set
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_mutex_set(const cy_mutex_t* mutex)
{
    cy_rslt_t status;
    if (mutex == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        BaseType_t result;
        #if (configUSE_RECURSIVE_MUTEXES == 1)
        result = (mutex->is_recursive)
                    ? xSemaphoreGiveRecursive(mutex->mutex_handle)
                    : xSemaphoreGive(mutex->mutex_handle);
        #else
        result = xSemaphoreGive(mutex->mutex_handle);
        #endif /* configUSE_RECURSIVE_MUTEXES */

        status = (result == pdFALSE)
                ? CY_RTOS_GENERAL_ERROR
                : CY_RSLT_SUCCESS;
    }
    return status;
}


#if defined(FREERTOS_COMMON_SECTION_END)
FREERTOS_COMMON_SECTION_END
#endif

CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 8.13", 1,
                             "Public API signature in cyabs_rtos.h is non-const for cross-kernel compatibility; some kernels modify the handle object in deinit paths.");
//--------------------------------------------------------------------------------------------------
// cy_rtos_mutex_deinit
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_mutex_deinit(cy_mutex_t* mutex)
{
    cy_rslt_t status;
    if (mutex == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        vSemaphoreDelete(mutex->mutex_handle);
        status = CY_RSLT_SUCCESS;
    }
    return status;
}


CY_MISRA_BLOCK_END("MISRA C-2012 Rule 8.13");


#endif /* configUSE_MUTEXES */


//==================================================================================================
// Semaphores
//==================================================================================================

//--------------------------------------------------------------------------------------------------
// cy_rtos_semaphore_init
//--------------------------------------------------------------------------------------------------
#if (configUSE_COUNTING_SEMAPHORES == 1)
cy_rslt_t cy_rtos_semaphore_init(cy_semaphore_t* semaphore, uint32_t maxcount, uint32_t initcount)
{
    cy_rslt_t status;
    if (semaphore == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        *semaphore = xSemaphoreCreateCounting(maxcount, initcount);
        if (*semaphore == NULL)
        {
            status = CY_RTOS_NO_MEMORY;
        }
        else
        {
            status = CY_RSLT_SUCCESS;
        }
    }
    return status;
}


#endif /* configUSE_COUNTING_SEMAPHORES */


//--------------------------------------------------------------------------------------------------
// cy_rtos_semaphore_get
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_semaphore_get(const cy_semaphore_t* semaphore, cy_time_t timeout_ms)
{
    cy_rslt_t status;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    // xSemaphoreTakeFromISR does not take timeout as a parameter
    // since it cannot block. Hence we return an error if the user
    // tries to set a timeout.
    if ((semaphore == NULL) || (is_in_isr() && (timeout_ms != 0U)))
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        TickType_t ticks = convert_ms_to_ticks(timeout_ms);
        status = CY_RSLT_SUCCESS;

        if (is_in_isr())
        {
            CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 11.2", 1,
                                         "FreeRTOS ISR API uses opaque handle types; semaphore handle is passed through API as required by contract.");
            if (pdFALSE == xSemaphoreTakeFromISR(*semaphore, &xHigherPriorityTaskWoken))
            {
                status = CY_RTOS_TIMEOUT;
            }
            else
            {
                portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
            }
            CY_MISRA_BLOCK_END("MISRA C-2012 Rule 11.2");
        }
        else
        {
            if (pdFALSE == xSemaphoreTake(*semaphore, ticks))
            {
                status = CY_RTOS_TIMEOUT;
            }
        }
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_semaphore_set
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_semaphore_set(const cy_semaphore_t* semaphore)
{
    cy_rslt_t status;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    if (semaphore == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        BaseType_t ret;

        if (is_in_isr())
        {
            CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 11.2", 1,
                                         "FreeRTOS ISR API uses opaque handle types; semaphore handle is passed through API as required by contract.");
            ret = xSemaphoreGiveFromISR(*semaphore, &xHigherPriorityTaskWoken);
            CY_MISRA_BLOCK_END("MISRA C-2012 Rule 11.2");

            if (ret == pdTRUE)
            {
                portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
            }
        }
        else
        {
            CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 11.2", 1,
                                         "FreeRTOS API uses opaque handle types; semaphore handle is passed through API as required by contract.");
            ret = xSemaphoreGive(*semaphore);
            CY_MISRA_BLOCK_END("MISRA C-2012 Rule 11.2");
        }

        if (ret == pdFALSE)
        {
            status = CY_RTOS_GENERAL_ERROR;
        }
        else
        {
            status = CY_RSLT_SUCCESS;
        }
    }

