zhanzr/cy8ckit-demo/app/mtb_shared/abstraction-rtos/release-v1.13.0/source/COMPONENT_FREERTOS/cyabs_rtos_freertos.c
    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_semaphore_get_count
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_semaphore_get_count(const cy_semaphore_t* semaphore, size_t* count)
{
    cy_rslt_t status;
    if (semaphore == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 11.2", 1,
                                     "FreeRTOS API uses opaque handle types; semaphore handle is passed through API as required by contract.");
        *count = uxSemaphoreGetCount(*semaphore);
        CY_MISRA_BLOCK_END("MISRA C-2012 Rule 11.2");
        status = CY_RSLT_SUCCESS;
    }
    return status;
}


#if (configUSE_COUNTING_SEMAPHORES == 1)
CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 8.13", 1,
                             "Public API signature in cyabs_rtos.h is non-const for cross-kernel compatibility; some kernels modify the handle object in deinit paths.");
//--------------------------------------------------------------------------------------------------
// cy_rtos_semaphore_deinit
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_semaphore_deinit(cy_semaphore_t* semaphore)
{
    cy_rslt_t status;
    if (semaphore == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 11.2", 1,
                                     "FreeRTOS API uses opaque handle types; semaphore handle is passed through API as required by contract.");
        vSemaphoreDelete(*semaphore);
        CY_MISRA_BLOCK_END("MISRA C-2012 Rule 11.2");
        status = CY_RSLT_SUCCESS;
    }
    return status;
}


CY_MISRA_BLOCK_END("MISRA C-2012 Rule 8.13");


#endif /* configUSE_COUNTING_SEMAPHORES */

//==================================================================================================
// Events
//==================================================================================================

//--------------------------------------------------------------------------------------------------
// cy_rtos_init_event
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_event_init(cy_event_t* event)
{
    cy_rslt_t status;
    if (event == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        *event = xEventGroupCreate();
        if (*event == NULL)
        {
            status = CY_RTOS_NO_MEMORY;
        }
        else
        {
            status = CY_RSLT_SUCCESS;
        }
    }
    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_event_setbits
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_event_setbits(const cy_event_t* event, uint32_t bits)
{
    cy_rslt_t status;
    if (event == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        BaseType_t ret;
        if (is_in_isr())
        {
            #if (configUSE_TIMERS == 1)
            BaseType_t xHigherPriorityTaskWoken = pdFALSE;
            ret = xEventGroupSetBitsFromISR(*event, (EventBits_t)bits, &xHigherPriorityTaskWoken);

            if (ret == pdTRUE)
            {
                portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
            }
            #else
            /* xEventGroupSetBitsFromISR requires configUSE_TIMERS == 1 */
            status = CY_RTOS_UNSUPPORTED;
            #endif /* configUSE_TIMERS */
        }
        else
        {
            // xEventGroupSetBits does not return pass/fail, but instead returns the value of the
            // event bits at the time the function returns. There is potential to
            // return 0 (value equal to pdFALSE), so instead treat it as successful after the call
            // to xEventGroupSetBits to avoid false error.
            (void)xEventGroupSetBits(*event, (EventBits_t)bits);
            ret = pdTRUE;
        }

        if (ret == pdFALSE)
        {
            status = CY_RTOS_GENERAL_ERROR;
        }
        else
        {
            status = CY_RSLT_SUCCESS;
        }
    }
    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_event_clearbits
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_event_clearbits(const cy_event_t* event, uint32_t bits)
{
    cy_rslt_t status;
    if (event == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        BaseType_t ret;
        if (is_in_isr())
        {
            #if (configUSE_TIMERS == 1)
            ret = xEventGroupClearBitsFromISR(*event, (EventBits_t)bits);
            #else
            /* xEventGroupClearBitsFromISR requires configUSE_TIMERS == 1 */
            status = CY_RTOS_UNSUPPORTED;
            #endif /* configUSE_TIMERS */
        }
        else
        {
            // xEventGroupClearBits does not return pass/fail, but instead returns the value of the
            // event bits before the requested bits were cleared. There is potential to
            // return 0 (value equal to pdFALSE), so instead treat it as successful after the call
            // to xEventGroupClearBits to avoid false error.
            (void)xEventGroupClearBits(*event, (EventBits_t)bits);
            ret = pdTRUE;
        }

        if (ret == pdFALSE)
        {
            status = CY_RTOS_GENERAL_ERROR;
        }
        else
        {
            status = CY_RSLT_SUCCESS;
        }
    }
    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_event_getbits
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_event_getbits(const cy_event_t* event, uint32_t* bits)
{
    cy_rslt_t status;
    if ((event == NULL) || (bits == NULL))
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        *bits  = xEventGroupClearBits(*event, 0U);
        status = CY_RSLT_SUCCESS;
    }
    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_event_waitbits
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_event_waitbits(const cy_event_t* event, uint32_t* bits, bool clear, bool all,
                                 cy_time_t timeout_ms)
{
    cy_rslt_t status;
    if ((event == NULL) || (bits == NULL))
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        TickType_t ticks = convert_ms_to_ticks(timeout_ms);
        uint32_t   bitsVal  = *bits;

