zhanzr/cy8ckit-demo/app/mtb_shared/abstraction-rtos/release-v1.13.0/source/COMPONENT_FREERTOS/cyabs_rtos_freertos.c
CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 8.13", 1,
                             "Public API signature in cyabs_rtos.h is non-const for cross-kernel compatibility; some kernels modify the handle object in deinit paths.");
//--------------------------------------------------------------------------------------------------
// cy_rtos_queue_deinit
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_queue_deinit(cy_queue_t* queue)
{
    cy_rslt_t status;
    if (queue == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        vQueueDelete(*queue);
        status = CY_RSLT_SUCCESS;
    }
    return status;
}


CY_MISRA_BLOCK_END("MISRA C-2012 Rule 8.13");


//==================================================================================================
// Timers
//==================================================================================================

#if (configUSE_TIMERS == 1)
//--------------------------------------------------------------------------------------------------
// cy_rtos_timer_init
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_timer_init(cy_timer_t* timer, cy_timer_trigger_type_t type,
                             cy_timer_callback_t fun, cy_timer_callback_arg_t arg)
{
    cy_rslt_t status;
    if ((timer == NULL) || (fun == NULL))
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        // Create a wrapper callback to make sure to call fun() with arg as opposed
        // to providing the timer reference as FreeRTOS does by default.
        CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 11.5", 1,
                                     "pvPortMalloc returns void* aligned to portBYTE_ALIGNMENT (>= sizeof(callback_data_t) alignment); conversion to callback_data_t* is safe - no alignment violation.");
        callback_data_t* cb_arg = (callback_data_t*)pvPortMalloc(sizeof(callback_data_t));
        CY_MISRA_BLOCK_END("MISRA C-2012 Rule 11.5");
        if (NULL == cb_arg)
        {
            status = CY_RTOS_NO_MEMORY;
        }
        else
        {
            cb_arg->cb  = fun;
            cb_arg->arg = arg;

            BaseType_t reload =
                (type == (cy_timer_trigger_type_t)CY_TIMER_TYPE_PERIODIC) ? pdTRUE : pdFALSE;
            *timer = xTimerCreate("", 1UL, (UBaseType_t)reload, cb_arg, &timer_callback);

            if (*timer == NULL)
            {
                vPortFree(cb_arg);
                status = CY_RTOS_NO_MEMORY;
            }
            else
            {
                status = CY_RSLT_SUCCESS;
            }
        }
    }
    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_timer_start
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_timer_start(const cy_timer_t* timer, cy_time_t num_ms)
{
    cy_rslt_t status;
    if (timer == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        TickType_t ticks = convert_ms_to_ticks(num_ms);
        BaseType_t ret;

        if (is_in_isr())
        {
            BaseType_t taskWoken = pdFALSE;
            ret = xTimerChangePeriodFromISR(*timer, ticks, &taskWoken);
            if (ret == pdPASS)
            {
                portYIELD_FROM_ISR(taskWoken);
                taskWoken = pdFALSE;
                ret = xTimerStartFromISR(*timer, &taskWoken);
                if (ret == pdPASS)
                {
                    portYIELD_FROM_ISR(taskWoken);
                }
            }
        }
        else
        {
            ret = xTimerChangePeriod(*timer, ticks, 0UL);
            if (ret == pdPASS)
            {
                ret = xTimerStart(*timer, 0UL);
            }
        }
        if (ret == pdFALSE)
        {
            status = CY_RTOS_GENERAL_ERROR;
        }
        else
        {
            status = CY_RSLT_SUCCESS;
        }
    }
    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_timer_stop
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_timer_stop(const cy_timer_t* timer)
{
    cy_rslt_t status;
    if (timer == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        BaseType_t ret;
        if (is_in_isr())
        {
            BaseType_t taskWoken = pdFALSE;
            CY_MISRA_DEVIATE_BLOCK_START("MISRA_CAST", 1,
                                         "Signedness conversion inside FreeRTOS macro expansion. Cannot modify third-party macro.");
            ret = xTimerStopFromISR(*timer, &taskWoken);
            CY_MISRA_BLOCK_END("MISRA_CAST");
            if (pdPASS == ret)
            {
                portYIELD_FROM_ISR(taskWoken);
            }
        }
        else
        {
            ret = xTimerStop(*timer, 0UL);
        }
        if (ret == pdFALSE)
        {
            status = CY_RTOS_GENERAL_ERROR;
        }
        else
        {
            status = CY_RSLT_SUCCESS;
        }
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_timer_is_running
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_timer_is_running(const cy_timer_t* timer, bool* state)
{
    cy_rslt_t status;
    if ((timer == NULL) || (state == NULL))
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        BaseType_t active = xTimerIsTimerActive(*timer);
        *state = (active != pdFALSE);

        status = CY_RSLT_SUCCESS;
    }
    return status;
}


CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 8.13", 1,
                             "Public API signature in cyabs_rtos.h is non-const for cross-kernel compatibility; some kernels modify the handle object in deinit paths.");
//--------------------------------------------------------------------------------------------------
// cy_rtos_timer_deinit
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_timer_deinit(cy_timer_t* timer)
{
    cy_rslt_t status;
    if (timer == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        void*      cb  = pvTimerGetTimerID(*timer);
        BaseType_t ret = xTimerDelete(*timer, 0UL);

        if (ret == pdFALSE)
        {
            status = CY_RTOS_GENERAL_ERROR;
        }
        else
        {
            vPortFree(cb);
            status = CY_RSLT_SUCCESS;
        }
    }
    return status;
}


CY_MISRA_BLOCK_END("MISRA C-2012 Rule 8.13");


#endif /* configUSE_TIMERS */


//==================================================================================================
// Time
//==================================================================================================

//--------------------------------------------------------------------------------------------------
// cy_rtos_time_get
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_time_get(cy_time_t* tval)
{
    cy_rslt_t status;
    if (tval == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        *tval  =
            (cy_time_t)(((uint64_t)xTaskGetTickCount() * 1000ULL) / (uint64_t)configTICK_RATE_HZ);
        status = CY_RSLT_SUCCESS;
    }
    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_delay_milliseconds
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_delay_milliseconds(cy_time_t num_ms)
{
    vTaskDelay(convert_ms_to_ticks(num_ms));
    return CY_RSLT_SUCCESS;
}


CY_MISRA_BLOCK_END("MISRA C-2012 Rule 10.4");
CY_MISRA_BLOCK_END("MISRA C-2012 Rule 10.3");
